tutorials/multiphase/icoReactingMultiPhaseInterFoam/inertMultiphaseMultiComponent/constant/thermophysicalProperties.mercury
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties.mercury;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       200.9;
    }
    equationOfState
    {
        rho             13529;
    }
    thermodynamics
    {
        Cp              139;
        Hf              0.0;
    }
    transport
    {
        mu              0.0015;
        Pr              0.8;
    }
}

// ************************************************************************* //
